# TriangleInShellComponent Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangleInShellComponent Constructor
TriangleInShellComponent Class See Also
---
Creates a copy of the given TriangleInShellComponent
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TriangleInShellComponent(
	TriangleInShellComponent other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As TriangleInShellComponent _
)
```

Visual C++
---
```text
public:
TriangleInShellComponent(
	TriangleInShellComponent^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..TriangleInShellComponent
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace